package kz.lesson.dbpractic.menu;

public class Menu {

    public static void hi() {
        System.out.println("_______________________________________________________________________");
        System.out.println("_________________________Добро пожаловать!_____________________________");
        System.out.println("_______________________________________________________________________");
    }


    public static void glavMenu() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("____________________  1.Добавить члена домашки_________________________");
        System.out.println("______________________2.Изменить список домашки________________________");
        System.out.println("______________________3.Удалить члена домашки__________________________");
        System.out.println("______________________4.Просмотреть список домашки_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________5.Выйти__________________________________________");
        System.out.println(": ");
    }

    public static void menu1() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________1.Добавить другого члена домашки_________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________2.Выход в главное меню___________________________");
        System.out.println(": ");

    }

    public static void menu2() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________1.Изменить имя___________________________________");
        System.out.println("______________________2.Изменить возраст_______________________________");
        System.out.println("______________________3.Изменить размер ноги___________________________");
        System.out.println("______________________4.Изменить пол___________________________________");
        System.out.println("______________________5.Изменить статус________________________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________6.Выход в главное меню___________________________");
        System.out.println(": ");

    }

    public static void menu3() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("____________________  1.Удалить другого члена домашки__________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________2.Выход в главное меню___________________________");
        System.out.println(": ");
    }


    public static void menu4() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________1.Весь список домашки____________________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________2.Выход в главное меню___________________________");
        System.out.println(": ");
    }
    public static void  menuAfter4() {
        System.out.println("______________________Ведите цифру для продолжения_____________________");
        System.out.println("_______________________________________________________________________");
        System.out.println("______________________1.Вернуться в предыдущее меню ___________________");
        System.out.println("_______________________________________________________________________");
        System.out.println(": ");

    }
}
